{"class_name": "Model", "config": {"name": "model_30", "layers": [{"name": "input_32", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 250, 2], "dtype": "float32", "sparse": false, "name": "input_32"}, "inbound_nodes": []}, {"name": "conv1d_59", "class_name": "Conv1D", "config": {"name": "conv1d_59", "trainable": true, "filters": 512, "kernel_size": [32], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_32", 0, 0, {}]]]}, {"name": "batch_normalization_103", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_103", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1d_59", 0, 0, {}]]]}, {"name": "max_pooling1d_50", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_50", "trainable": true, "strides": [3], "pool_size": [3], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_103", 0, 0, {}]]]}, {"name": "dropout_89", "class_name": "Dropout", "config": {"name": "dropout_89", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_50", 0, 0, {}]]]}, {"name": "flatten_16", "class_name": "Flatten", "config": {"name": "flatten_16", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_89", 0, 0, {}]]]}, {"name": "dense_61", "class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "batch_input_shape": [null, 250], "dtype": "float32", "units": 250, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_16", 0, 0, {}]]]}, {"name": "dropout_90", "class_name": "Dropout", "config": {"name": "dropout_90", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_61", 0, 0, {}]]]}, {"name": "batch_normalization_104", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_104", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_90", 0, 0, {}]]]}, {"name": "dense_62", "class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "units": 250, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_104", 0, 0, {}]]]}], "input_layers": [["input_32", 0, 0]], "output_layers": [["dense_62", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}